In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from datetime import datetime

In [2]:
datetime(2022,11,21,0,0)

datetime.datetime(2022, 11, 21, 0, 0)

In [5]:
date=datetime.now()
date

datetime.datetime(2022, 7, 1, 17, 36, 17, 851299)

In [6]:
date.weekday()

4

In [7]:
date.year

2022

In [8]:
date.hour

17

In [9]:
df=pd.read_csv("C:/Users/91790/madrid/pandas/examples-20220606T051259Z-001/examples/examples/tseries.csv")

In [10]:
df

   Unnamed: 0  0
0  2000-01-01  0
1  2000-01-02  1
2  2000-01-03  2
3  2000-01-04  3
4  2000-01-05  4
5  2000-01-06  5
6  2000-01-07  6

In [11]:

df.rename(columns={'Unnamed: 0':'Date','0':'value'},inplace=True)

In [12]:
df

         Date  value
0  2000-01-01      0
1  2000-01-02      1
2  2000-01-03      2
3  2000-01-04      3
4  2000-01-05      4
5  2000-01-06      5
6  2000-01-07      6

In [13]:
from datetime import datetime as dt

In [15]:
df['Date']=pd.to_datetime(df['Date'])

In [16]:
df['Date']

0   2000-01-01
1   2000-01-02
2   2000-01-03
3   2000-01-04
4   2000-01-05
5   2000-01-06
6   2000-01-07
Name: Date, dtype: datetime64[ns]

In [18]:
df['year']=df['Date'].dt.year

In [19]:
df['year']

0    2000
1    2000
2    2000
3    2000
4    2000
5    2000
6    2000
Name: year, dtype: int64

In [20]:
df['Date'].dt.month

0    1
1    1
2    1
3    1
4    1
5    1
6    1
Name: Date, dtype: int64

In [22]:
df['Date'].dt.day

0    1
1    2
2    3
3    4
4    5
5    6
6    7
Name: Date, dtype: int64

In [23]:
df

        Date  value  year
0 2000-01-01      0  2000
1 2000-01-02      1  2000
2 2000-01-03      2  2000
3 2000-01-04      3  2000
4 2000-01-05      4  2000
5 2000-01-06      5  2000
6 2000-01-07      6  2000